---
kind: method
id: M:Autodesk.Revit.DB.WorksetId.#ctor(System.Int32)
source: html/44958d4b-500f-f5d0-85c0-4ddf77faeafc.htm
---
# Autodesk.Revit.DB.WorksetId.#ctor Method

Create an WorksetId handle with the given integer id.

## Syntax (C#)
```csharp
public WorksetId(
	int id
)
```

## Parameters
- **id** (`System.Int32`) - The id.